Tekla Open API Reference for Tekla Structures 2025
RebarGuideline Properties
The RebarGuideline type exposes the following members.
Properties
Name | Description
ChamferType
 Gets or sets the chamfer type of the guideline. To create longitudinal bars on the top/bottom face of a flat polybeam, create a guideline at each corner, and use the ARC_POINT chamfer type at "curved" corners, and NONE otherwise.
Curve
 Gets or sets the geometric Contour of the rebar guideline.
FollowEdges
 Gets or sets a flag that indicates whether the guideline should attempt to follow the leg face edges located between its end points.
Id
 Gets or sets an identifier that may be used to identify instances of the same rebar guideline.
Spacing
 Gets or sets the RebarSpacing along the rebar guideline.
Top
See Also
Reference
RebarGuideline Class
Tekla.Structures.Model Namespace